<?php

use yii\db\Migration;

class m170411_195150_add_locale extends Migration
{
    public function up()
    {
        $this->addColumn("{{static_pages}}", 'locale',
            $this->char(5)->notNull()->after('content')->defaultValue("")->comment("Локаль"));

        $this->alterColumn("{{static_pages}}",'content','MEDIUMTEXT');

        $this->addColumn("{{article}}", "locale",
            $this->char(5)->notNull()->after("status")->defaultValue("")->comment("Локаль"));

        $this->addColumn("{{article_category}}", "locale",
            $this->char(5)->notNull()->after("name")->defaultValue("")->comment("Локаль"));

        $this->update("{{article_category}}",['locale'=>'ru_RU',],'id_article_category=1');
        $this->update("{{article_category}}",['locale'=>'ru_RU',],'id_article_category=2');

        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=1');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=2');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=3');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=4');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=5');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=6');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=7');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=8');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=9');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=10');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=11');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=12');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=13');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=14');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=15');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=16');
        $this->update("{{article}}",['locale'=>'ru_RU'],'id_article=17');

        $this->update("{{static_pages}}",[
            'content' => '<p><span class="glyphicon glyphicon-map-marker" aria-hidden="true"></span> Адрес:  ООО "Майранк", Офис 5, Бизнес-центр "Нипсэнд Триангл", 1, Бартон Роуд, Шеффилд, Южный Йоркшир, S3 8BW, Великобритания</p><p><span class="glyphicon glyphicon-earphone" aria-hidden="true"></span> Телефон: <a href="tel:+6511112222">+65 1111 2222</a></p><p><span class="glyphicon glyphicon-envelope" aria-hidden="true"></span> E-mail: <a href="mailto:info@myrank.com">info@myrank.com</a></p>',
            'locale' => 'ru_RU'
        ],'id=1');

        $this->update("{{static_pages}}",[
            'title' => 'О СЕРВИСЕ',
            'content' => '<p>Предназначение</p><p>В сети Интернет существует множество социальных сетей, как общей направленности (Facebook, VK), так и специализированных (LinkedIn). По профилю пользователя обычно можно сложить впечатление о нем – круг интересов, круг общения, увлечения, умение грамотно излагать свои мысли, эмоциональное состояние. Если человек представлен в нескольких различных соцсетях одновременно, то можно составить его «портрет» довольно подробно.</p><p>Этим часто пользуются менеджеры по персоналу. Одним из «негласных» этапов проверки кандидата является анализ его профилей в соцсетях. И если кандидат ведет себя на своих страницах неадекватно, безграмотно пишет, нападает на других пользователей, то ему будет довольно сложно получить хорошую работу в престижной компании.</p><p>Что касается компаний, то во многих странах существуют открытые реестры. Когда необходимо проверить контрагента или нового потенциального партнера по бизнесу, то можно в онлайне получить достаточно подробную информацию – регистрационный номер компании, директор, размер уставного фонда, состав учредителей и их доли в уставном фонде, контактная информация, наличие налоговых задолженностей, наличие судебных разбирательств и многое другое. В некоторых странах достаточно сделать пару запросов в онлайне – один на сайте регистратора, а второй – на сайте налогового ведомства. В других существуют специализированные сервисы, которые позволяют с помощью одного запроса получить детальную информацию из всех открытых реестров.</p><p>Но в обоих случаях, как с человеком, так и с компанией, существует потребность в субъективных отзывах и мнениях: от коллег и начальства – как человек проявил себя на предыдущем месте работы, от друзей и знакомых – об общечеловеческих качествах, от партнеров по бизнесу и заказчиков – о деловых качествах. В случае с компаниями, потенциальным партнерам и заказчикам будет интересно знать, как компания выполняет взятые на себя обязательства и насколько реальное качество ее продуктов или услуг соответствует заявленному в описании на официальном сайте.</p><p>Существующие сервисы и соцсети позволяют оставлять отзывы и комментарии. Даже на странице компании в FB можно иногда прочитать интересные отзывы. Но, во-первых, они практически всегда жестко модерируются. Никто не захочет оставлять негативные отзывы о себе. Во- вторых, рядовому менеджеру необходимо обладать талантом специалиста по конкурентной разведке, чтобы по крупицам насобирать необходимую информацию по отзывам и комментариям на разных ресурсах.</p><p>Сервис MyRank.com решает описанную выше проблему и предоставляет единый специализированный сервис, который по целому набору критериев позволяет оценить человека или компанию и сформировать объективное впечатление о нем на основании субъективных отзывов и оценок.</p><p>Целевая аудитория</p><p>Основной целевой аудиторией сервиса MyRank.com являются:</p><ul><li>HR-менеджеры (менеджеры по персоналу), которые набирают сотрудников и нуждаются в оценках их профессиональных и личных качеств, исполнительности, обучаемости, способности вписаться в коллектив, эмоционального состояния – не на основании тех сведений, которые написал сам же кандидат в своем резюме, но на основании реальных мнений о нем других людей;</li><li>менеджеры и руководители высшего звена, которым необходимо оценить надежность, честность и профессионализм потенциального партнера или контрагента.<br>Миссия</li></ul><p>Сервис MyRank позволяет оценивать разнообразные качества пользователей по 10-балльной шкале и выводить общую среднюю оценку их рейтинга.</p><p>При оценивании пользователя по какому либо критерию, оценивающий имеет возможность ввести свой отзыв, пояснив текстом, почему он поставил ту или иную оценку.</p><p>По общей и средним оценкам строятся полярные диаграммы по категориям и критериям оценки. В идеальном случае, диаграмма должна представлять собой круг – колесо, которое свободно и ровно катится по жизни. Отсюда вытекает миссия сервиса MyRank: помогать людям контролировать свои приоритеты и «выравнивать колесо» своей жизни.</p>',
            'title_browser' => 'О СЕРВИСЕ',
            'locale' => 'ru_RU'
        ],'id=2');

        $this->update("{{static_pages}}",[
            'content' => '<div class="b-info__how-work__content "><ul><li><span class="b-info__how-work__icon b-info__how-work__icon_1 "></span><span class="b-info__how-work__text ">Регистрация Пользователя/Компании</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_2 "></span><span class="b-info__how-work__text ">Заполните информацию о профиле, чтобы получить максимально высокий бал.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_3 "></span><span class="b-info__how-work__text ">Оценивайте партнеров, коллег и знакомых, оставляйте о них отзывы.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_4 "></span><span class="b-info__how-work__text ">Повышайте рейтинг профиля, получайте отзывы.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_5 "></span><span class="b-info__how-work__text ">Высокий рейтинг - карьерный рост.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_6 "></span><span class="b-info__how-work__text ">Ищите партнеров для своего бизнеса.</span></li></ul></div>',
            'locale' => 'ru_RU'
        ],'id=3');

        $this->update("{{static_pages}}",[
            'title' => 'Условия использования сервиса',
            'content' =>'<p>Данные в процессе перевода.</p>',
            'title_browser' => 'Условия использования сервиса',
            'locale' => 'ru_RU'],'id=4');

        $this->insert('{{article_category}}', ['name' => 'News','locale' => 'en_US']);
        $this->insert('{{article_category}}', ['name' => 'Productivity', 'locale' => 'en_US']);

        $this->insert('{{article_category}}', ['name' => 'Новини','locale' => 'ua_UA']);
        $this->insert('{{article_category}}', ['name' => 'Продуктивність', 'locale' => 'ua_UA']);

        $this->dropIndex('idx-static_pages-alias','{{static_pages}}');
        $this->createIndex('idx-static_pages-alias','{{static_pages}}',['alias'],false);

        $this->insert('{{static_pages}}', [
            'title' => 'CONTACTS',
            'alias' => 'contacts',
            'published' => 1,
            'content' => '<p><span class="glyphicon glyphicon-map-marker" aria-hidden="true"></span> Address:  MYRANK LIMITED, OFFICE 5, NEEPSEND TRIANGLE, 1, BURTON ROAD, SHEFFIELD, SOUTH YORKSHIRE, S3 8BW, UNITED KINGDOM</p><p><span class="glyphicon glyphicon-earphone" aria-hidden="true"></span> ТелеPhone Number: <a href="tel:+6511112222">+65 1111 2222</a></p><p><span class="glyphicon glyphicon-envelope" aria-hidden="true"></span> E-mail: <a href="mailto:info@myrank.com">info@myrank.com</a></p>',
            'locale' => 'en_US']);

        $this->insert('{{static_pages}}', [
            'title' => 'ABOUT THE SERVICE',
            'alias' => 'aboutus',
            'published' => 1,
            'content' => '<p>Data in translation process.</p>',
            'locale' => 'en_US']);

        $this->insert('{{static_pages}}', [
            'title' => 'HELP',
            'alias' => 'help',
            'published' => 1,
            'content' => '<div class="b-info__how-work__content "><ul><li><span class="b-info__how-work__icon b-info__how-work__icon_1 "></span><span class="b-info__how-work__text ">User Registration / Company Registration</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_2 "></span><span class="b-info__how-work__text ">Fill out the profile information to get the highest score.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_3 "></span><span class="b-info__how-work__text ">Evaluate partners, colleagues and acquaintances, leave feedback about them.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_4 "></span><span class="b-info__how-work__text ">Increase the profile rating, get feedback.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_5 "></span><span class="b-info__how-work__text ">High rating - career growth.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_6 "></span><span class="b-info__how-work__text ">Look for partners for your business.</span></li></ul></div>',
            'locale' => 'en_US']);

        $this->insert('{{static_pages}}', [
            'title' => 'TERMS OF SERVICE',
            'alias' => 'legalinfo',
            'published' => 1,
            'content' => '<p>Data in translation process.</p>',
            'locale' => 'en_US']);

        $this->insert('{{static_pages}}', [
            'title' => 'КОНТАКТИ',
            'alias' => 'contacts',
            'published' => 1,
            'content' => '<p><span class="glyphicon glyphicon-map-marker" aria-hidden="true"></span> Адреса:  ТОВ "Міранк", Офіс 5, Бізнес-центр "Ніпсенд Тріангл", 1, Бартон Роуд, Шеффілд, Південний Йоркшир, S3 8BW, Об\'єднане Королівство</p><p><span class="glyphicon glyphicon-earphone" aria-hidden="true"></span> Телефон: <a href="tel:+6511112222">+65 1111 2222</a></p><p><span class="glyphicon glyphicon-envelope" aria-hidden="true"></span> E-mail: <a href="mailto:info@myrank.com">info@myrank.com</a></p>',
            'locale' => 'ua_UA']);

        $this->insert('{{static_pages}}', [
            'title' => 'ПРО НАШ СЕРВІС',
            'alias' => 'aboutus',
            'published' => 1,
            'content' => '<p>Дані в процесі перекладу.</p>',
            'locale' => 'ua_UA']);

        $this->insert('{{static_pages}}', [
            'title' => 'ДОПОМОГА',
            'alias' => 'help',
            'published' => 1,
            'content'=>'<div class="b-info__how-work__content "><ul><li><span class="b-info__how-work__icon b-info__how-work__icon_1 "></span><span class="b-info__how-work__text ">Реєстрація Користувача / Компанії.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_2 "></span><span class="b-info__how-work__text ">Заповніть інформацію профілю, щоб отримати максимально високий бал.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_3 "></span><span class="b-info__how-work__text ">Оцінюйте партнерів, колег і знайомих, залишайте про них відгуки.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_4 "></span><span class="b-info__how-work__text ">Підвищуйте рейтинг профілю, отримуйте відгуки.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_5 "></span><span class="b-info__how-work__text ">Високий рейтинг - кар\'єрний ріст.</span></li><li><span class="b-info__how-work__icon b-info__how-work__icon_6 "></span><span class="b-info__how-work__text ">Шукайте партнерів для свого бізнесу.</span></li></ul></div>',
            'locale' => 'ua_UA']);

        $this->insert('{{static_pages}}', [
            'title' => 'УМОВИ ВИКОРИСТАННЯ СЕРВІСУ',
            'alias' => 'legalinfo',
            'published' => 1,
            'content' => '<p>ТОВ "Міранк" (надалі — "Компанія"), публікує цю Угоду, що визначає порядок використання сайту в мережі Інтернет за адресою myrank.com (надалі — "Портал"), є користувальницькою угодою для будь-якої особи чи компанії, що використовує Портал, матеріали або інші елементи Порталу, і іменованого надалі "Користувач". Компанія пропонує укласти Угоду будь-якому Користувачу. Угоду викладено в стандартній і незмінною для всіх формі у вигляді публічної оферти, шляхом прийняття в цілому наступних умов.</p><p>1. Предмет договору</p><p>1.1 Угода про використання Порталу (надалі — "Угода") регулює умови використання Користувачами Порталу.</p><p>1.2 Діюча версія Угоди доступна за адресою — (http://myrank.com/page/legalinfo). Користувач зобов’язується стежити за актуальною редакцією Угоди, а також редакцією Угоди з моменту використання Порталу або його сервісів.</p><p>1.3 Угода може бути змінена Компанією без будь-якого попереднього повідомлення Користувача. Нова редакція Угоди набуває чинності з моменту її розміщення, якщо інше не передбачено новою редакцією Угоди.</p><p>1.4 Угода набуває чинності з моменту початку використання Порталу або його сервісів.</p><p>1.5 На Порталі можуть бути додатково встановлені умови використання окремих його сервісів і розділів з інформацією.</p><p>1.6 Якщо Користувач не згоден з Угодою, він не може користуватися Порталом, його матеріалами і сервісами.</p><p>1.7 Всі матеріали, ресурси та сервіси, розміщені на Порталі на момент затвердження Угоди, а також ті, що будуть розміщені в майбутньому, є предметом Угоди і власністю (використовуваним активом /об’єктом) Компанії, якщо інше не зазначено на Порталі.</p><p>1.8 Компанія та / або редакція Порталу, призначена Компанією (надалі — "Редакція"), мають право додавати, змінювати, видаляти, доповнювати матеріали і структуру Порталу.</p><p>1.9 Компанія та / або редакція Порталу, призначена Компанією (надалі — "Редакція"), мають право в будь-який час закрити Портал або який-небудь розділ або сервіс без попереднього повідомленняКористувача.</p><p>1.10 Користувач зобов’язаний виконувати правила використання матеріалів та інших елементів і сервісів Порталу, розміщених на головній сторінці Порталу.</p><p>1.11 У разі виявлення фактів несанкціонованого використання матеріалів Порталу, Користувач повинен якнайшвидше повідомити про це Редакцію.</p><p>1.12 Компанія повідомляє, що через Портал можна отримати доступ до інших ресурсів (сайтів) в мережі Інтернет. Компанія не має ніякого контролю над цими сайтами, і Користувач отримує доступ до них виключно на власний ризик. Користувач визнає і погоджується з тим, що компанія не несе відповідальності за доступність до таких ресурсів (сайтів) і їх контент, а також за будь-які наслідки, пов’язані з використанням контенту цих сайтів.</p><p>1.13 Користувач користується Порталом виключно навласний ризик. Користувач несе відповідальність за будь-який збиток, заподіяний комп’ютеру користувача і його даним. Компанія не несе відповідальності, у тому числі за відповідність Порталу цілям користувача.</p><p>1.14 Компанія та / або Редакція ні в якому разі не несе відповідальності за будь-які прямі, непрямі збитки, збитки понесені у зв’язку зі сплатою штрафних санкцій, або будь-які збитки взагалі, навіть якщо Компанію було заздалегідь повідомлено про можливість такого збитку, у зв’язку з використанням та / або неможливістю використання Порталу.</p><p>1.15 Компанія намагається забезпечувати безперебійну роботу Порталу, однак не несе відповідальності за повну або часткову втрату контенту Порталу, а також за недостатню якість або швидкість перегляду такого контенту.</p><p>1.16 Контент Порталу не може бути використаний третіми особами для публічного перегляду.</p><p>1.17 Контент Порталу не може бути використаний третіми особами в комерційних цілях.</p><p>1.18 Дана Угода є договором приєднання, у зв’язку з чим: — Угода укладається лише шляхом приєднання до нього в цілому Користувача, який виявив намір укласти Угоду; — Користувач, який висловив намір укласти Угоду, не може запропонувати свої умови Угоди; — У разі незгоди зі змістом та формою Угоди або окремих її положень Користувач, що виявляє намір укласти Угоду, має право відмовитися від його укладення.</p><p>1.19 Користувач погоджується, що уклав Угоду при повному розумінні її змісту.</p><p>1.20 Підтвердженням укладення Угоди є використання Порталу або його сервісів.</p><p>1.21 Всі запити на правомірне використання контенту (матеріалів) повинні бути відправлені по електронній пошті на адресу (info@myrank.com)</p><p>2. Компанія має право:</p><p>2.1 використовувати адреси електронної пошти зареєстрованих користувачів для розсилки повідомлень;</p><p>2.2 видаляти повідомлення та коментарі Користувача, якщо вони суперечать умовам Угоди і нормам чинного законодавства України;</p><p>2.3 заблокувати акаунт (обліковий запис) Користувача на Порталі, у випадку порушень умов Угоди;</p><p>2.4 видалити будь-який контент без пояснення причин, у разі порушень чинного законодавства України, умов Угоди та / або інших правил користування Порталом;</p><p>2.5 в будь-який час закрити будь-який ресурс (сервіс) Порталу як з, так і без попереднього повідомлення Користувача. У такому випадку Компанія не несе відповідальності за припинення доступу до своїх ресурсів на Порталі.</p><p>3. Користувач має право:</p><p>3.1. створювати власні текстові повідомлення, коментарі, а також обмінюватися думками з приводу відповідної тематики опублікованої інформації. Компанія надає Користувачеві можливість брати участь в дискусіях на Порталі, включаючи коментарі, рекомендації, точки зору читачів, огляди, рейтинги та інші сервіси Порталу. Будь-яка інформація, яку ви надаєте, вказавши ваше ім’я, Ідентифікаційні дані в будь-якій соціальній мережі в мережі Інтернет, або будь-яке зображення або фотографію, стає надбанням громадськості, і може бути використана Компанією в рекламних або комерційних цілях в будь-яких засобах масової інформації, інтернет-сайтах або інших джерелах інформації. Користувач, який бере участь у дискусії на Порталі (його розділах, елементах і сервісах) погоджується, що будь-яка особиста інформація, надана Користувачем, може бути прочитана, зібрана чи використана іншими користувачами цих послуг або Компанією, і може бути використана для розсилки небажаних повідомлень. Компанія не несе відповідальність за особисту інформацію, яку Користувач надає в коментарях і не зобов’язана публікувати, видаляти або редагувати будь-який з коментарів Користувача. Користувач надає Адміністрації дозвіл на обробку наданої ним інформації, передбачає також і використання такої інформації, у тому числі і з метою маркетингових досліджень і таргетингу на Порталі. Користувач бере участь у дискусії на Порталі (його розділах, елементах і сервісах) погоджується, що його дії будуть публічними. Крім того, вони можуть бути включені в RSS-канали, прикладний програмний інтерфейс, і стати доступними для інших веб-сайтів за допомогою інших форматів. В результаті, надана Користувачем інформація може з’явитися на інших сайтах, блогах, і так далі. Компанія не несе відповідальності за будь-яку особисту інформацію, яку ви вирішили оприлюднити через функціонал Порталу, і Користувач погоджується, що ця інформація буде вважатися наданої Користувачем, а не Компанією. Інформацію про відвідування (використанні) Користувачем Порталу (його розділів, елементів і сервісів) — при доступі до Порталу через браузер, додатки або інший клієнт, автоматично записується на сервери Компанії. Ці журнали серверів можуть містити веб-запити, IP-адресу, тип і мову браузера, дату і час запиту, а також містити один або декілька файлів cookie, за якими можна визначити браузер або аккаунт або особу користувача (у випадках, встановлених законодавством). Користувальницькі повідомлення — коли Користувач в процесі взаємодії при використанні Порталу відправляє повідомлення, у тому числі в служби підтримки, можливо зберігання і обробка цих повідомлень для відповідей на запитання і подальшого вдосконалення функціонування Порталу і сервісів Компанії. Для зв’язку з Користувачем Порталу може використовуватися адреса електронної пошти, надана Користувачем. Приймаючи дану Угоду, Користувач розуміє і погоджується, що безоплатно передає Компанії невиключні права інтелектуальної власності на такі об’єкти права інтелектуальної власності, які розміщуються ним на Порталі: право на використання творів, статей, коментарів, фотографій, відео, графіки, інших об’єктів права інтелектуальної власності (далі, для зручності — "твір") і невиключне право на дозвіл або заборону використання твору іншими особами дає Компанії право самостійно використовувати та / або дозволяти або забороняти: — Відтворення творів; — Публічне виконання і публічне сповіщення творів; — Публічну демонстрацію і публічний показ; — Будь-яке повторне оприлюднення творів, якщо воно здійснюється іншою організацією, ніж та, що здійснила перше оприлюднення; — Переклади творів; — Переробки, адаптації та інші подібні зміни творів; — Включення творів як складових частин до збірників, антологій, енциклопедій і т.п.; — Розповсюдження творів шляхом першого продажу, відчуження іншим способом або шляхом здавання в майновий найм чи у прокат та шляхом іншої передачі до першого продажу примірників твору; — Доведення своїх творів до загального відома публіки таким чином, що її представники можуть здійснити доступ до творів з будь-якого місця і в будь-який час за їх власним вибором; — Здавання в майновий найм та / або комерційний прокат після першого продажу, відчуження іншим способом оригіналу або примірників творів, у тому числі у формі, яку зчитує комп’ютер; — Імпорт примірників творів.</p><p>4. Матеріали, які надаються Користувачем:</p><p>На сайті заборонено розміщувати і поширювати: — Заклики до насильницької зміни чи повалення Конституційного ладу або до захоплення державної влади; — Заклики про розподіл кордонів, території або державного кордону України, порушення порядку, встановленого Конституцією України; — Заклики до підпалу, знищення майна, захоплення будівель та споруд, насильницького виселення громадян; — Заклики до агресії або розпалюванню військового конфлікту або розміщувати інший матеріал, який може становити кримінальний злочин або причину його вчинення; — Матеріали, які є незаконними, шкідливими; — Ображають моральність, честь і гідність, права та охоронювані законом інтереси третіх осіб, а також нецензурні вирази й матеріали і висловлення порнографічного, еротичного чи сексуального характеру; — Матеріали рекламного, комерційного або адаптаційного характеру, розміщення яких не погоджено з Компанією; — Об’єкти інтелектуальної власності, на які оформлено авторські права, без наявності відповідного дозволу на таке публічне розміщення або поширення; — Матеріали, що містять комп’ютерні коди, призначені для порушення, знищення або обмеження функціональності будь-якого комп’ютерного або телекомунікаційного устаткування або програм, для здійснення несанкціонованого доступу, а також серійні номери до комерційних програмних продуктів, логіни, паролі та інші засоби для отримання несанкціонованого доступу до платних ресурсів в інтернет; — Персональні дані інших користувачів; — Матеріали, зміст та / або розповсюдження яких порушує чинне законодавство України та положення міжнародного законодавства; — Інформацію комерційного характеру, яка відноситься до особистості користувача. Користувач підтверджує, що несе відповідальність за дотримання вимог законодавства України, в тому числі, Конституції України, законів України "Про захист суспільної моралі", "Про рекламу", "Про авторське право і суміжні права", "Про охорону знаків для товарів і послуг", не обмежуючись перерахованим, включаючи повну відповідальність за зміст і форму будь-якої інформації, яку надає та розміщує на Порталі. У разі пред’явлення Компанії претензій з боку третіх осіб у зв’язку з інформацією, що розміщується Користувачем на Порталі (у тому числі і претензії з боку власників авторських прав та / або суміжних прав, їхніх уповноважених представників або третіх осіб), Користувач зобов’язаний самостійно і за свій рахунок врегулювати і вирішувати всі спори з особами, які подали претензії, а також відшкодувати Компанії понесені збитки в повному обсязі.</p><p>5. Модерування</p><p>5.1. Модерування інтерактивних ресурсів на Порталі (коментарі, форуми, блоги) здійснюється за принципом постмодерації. Ці повідомлення спочатку додаються, а потім перевіряються модераторами.</p><p>5.2. Якщо модератор вважає, що будь-який текст порушує правила користування Порталом або Договір, він має право видалити його.</p>',
            'locale' => 'ua_UA']);
    }

    public function down()
    {
        $this->dropColumn("{{article_category}}", "locale");
        $this->dropColumn("{{article}}", "locale");
        $this->alterColumn("{{static_pages}}","content","TEXT");
        $this->dropColumn("{{static_pages}}", "locale");
    }
}
